backend/controllers/BrandController.php

    public function actionIndex(){
        $query=Brand::find();
        //显示列表
        //实例化一个分页对象
        $pager=new Pagination([
            'totalCount'=>$query->where(['>','status',-1])->count(),
            'PageSize'=>2
        ]);
        $models=Brand::find()->where(['>','status',-1])->limit($pager->limit)->offset($pager->offset)->all();
---
SELECT COUNT(*) FROM `brand` WHERE `status` > -1
SELECT * FROM `brand` WHERE `status` > -1 LIMIT 2

    public function actionAdd(){
        $model= new Brand();
        $request=\Yii::$app->request;
        if ($request->isPost){
            //接收数据
            $model->load($request->post());
            //var_dump($model);exit;
            //接收图片
            //$model->file=UploadedFile::getInstance($model,'file');
            //var_dump($model->file);exit;
            //后台验证
           if($model->validate()){
                //移动文件
                //$file='/upload/'.uniqid().'.'.$model->file->getExtension();
                //var_dump($file);exit;
                //得到文件的绝对路径
                //$model->file->saveAs(\Yii::getAlias('@webroot').$file,false);
                //var_dump($model->file);exit;
                //$model->logo=$file;
                //保存数据
               //var_dump($model);die;
                $model->save();
---
INSERT INTO `brand` (`name`, `intro`, `logo`, `sort`, `status`) VALUES ('CK', '世界品牌', 'http://ow0evxet8.bkt.clouddn.com//upload/06/f4/06f4e85d9869dbe867901883bcc5880870333e4e.jpg', 1, 2)

    public function actionDel(){
        //接收ajax传过来的id
        $id=\Yii::$app->request->post('id');
        //var_dump($id);exit;
        $model=Brand::findOne(['id'=>$id]);
        if($model){
            //修改status的值为-1不显示
            $model->status=-1;
            //保存
            $model->save(false);
---
SELECT * FROM `brand` WHERE `id`='13'
UPDATE `brand` SET `status`=-1 WHERE `id`=13