backend/controllers/GoodsController.php

    public function actionIndex()
    {

        $query= Goods::find();
        //搜索



        //实例化一个对象
        $pager=new Pagination([
            'totalCount'=>$query->count(),
            'PageSize'=>2
        ]);
        $request=\Yii::$app->request->get();
       // var_dump($request);exit;
            $models=Goods::find()->limit($pager->limit)->offset($pager->offset)->all();
---
SELECT COUNT(*) FROM `goods`
SELECT * FROM `goods` LIMIT 2 OFFSET 2

    public function actionAdd()
    {
        $model = new Goods();
        $intros=new GoodsIntro();
        $request=\Yii::$app->request;
        if($request->isPost){
            //接收数据
            $model->load($request->post());
            $intros->load($request->post());

            //var_dump($model);exit;

            //echo '<pre>';
            //var_dump($model);exit;
            //后台验证
            if($model->validate() && $intros->validate()){
                //保存货号到数据库
                //得到当前日期
                $day=date('Ymd');
                //var_dump($day);exit;
                //查询表里的数据
                $dayCount=GoodsDayCount::findOne(['day'=>$day]);
---
SELECT * FROM `goods_day_count` WHERE `day`='20170921'

                $intros->goods_id=$model->id;
                $intros->save();
                $dayCount->count++;
                $dayCount->save();
---
UPDATE `goods_day_count` SET `count`=7 WHERE `day`='2017-09-21 00:00:00'

            }
        }
            //获取品牌数据
        $brands = Brand::find()->all();
---
SELECT * FROM `brand`

    public function actionEdit($id){
        $model=Goods::findOne(['id'=>$id]);
        $intros=GoodsIntro::findOne(['goods_id'=>$id]);
        $brands = Brand::find()->all();
        $request=\Yii::$app->request;
        if($request->isPost){
            //接收数据
            $model->load($request->post());
            $intros->load($request->post());
            //后台验证
            if($model->validate() && $intros->validate()){
                $model->save();
---
SELECT * FROM `goods` WHERE `id`='34'
SELECT * FROM `goods_intro` WHERE `goods_id`='34'
SELECT * FROM `brand`
UPDATE `goods` SET `goods_category_id`=46, `brand_id`=15, `stock`=1879, `is_on_sale`=1, `status`=1, `sort`=1 WHERE `id`=34

    public function actionGallery($id)
    {
        $goods = Goods::findOne(['id'=>$id]);
---
SELECT * FROM `goods` WHERE `id`='37'