frontend/controllers/MemberController.php

    public function actionLogin()
    {
        $model = new LoginForm();
        $request = \Yii::$app->request;
        if ($request->isPost) {
            $model->load($request->post(), '');
            //var_dump($model);exit;
            if ($model->validate()) {
//                var_dump($model->rememberMe);exit;
                //取出username和数据库进行对比
                $user = Member::findOne(['username' => $model->username]);
---
SELECT * FROM `member` WHERE `username`='admin'

                        if($cart){
                            //如果数据表已经有这个商品,就合并cookie中的数量
                            $cart->amount+=$amount;
                            $cart->save();
---
UPDATE `cart` SET `amount`=2 WHERE `id`=20

    public function actionIndex()
    {
        $categories = GoodsCategory::find()->all();
---
SELECT * FROM `goods_category`

    public function actionGoods($id){
        $model=Goods::findOne(['id'=>$id]);
---
SELECT * FROM `goods` WHERE `id`='33'

                $cart->goods_id=$goods_id;
                $cart->amount=$amount;
                $cart->member_id=\Yii::$app->user->id;
                $cart->insert();
---
INSERT INTO `cart` (`goods_id`, `amount`, `member_id`) VALUES (33, 1, 22)

    public function actionCart(){
        //判断是否登录
        if(\Yii::$app->user->isGuest){
            $cookies=\Yii::$app->request->cookies;
            //注意因为存进去的时候是序列化的值 所以取出的时候需要反序列化
            $cart=$cookies->getValue('carts');
            if($cart){
                $carts=unserialize($cart);
                //var_dump($carts);exit;
            }else{
                //没有数据
                $carts=[];
            }
            //根据cookie中有的数据的id去商品表中查对应的数据来显示到页面,cookie中得数据无法进行显示
            $models=Goods::find()->where(['in','id',array_keys($carts)])->all();
            //var_dump($carts);exit;
            return $this->renderPartial('cart',['models'=>$models,'carts'=>$carts]);
        }else{
            //登录查询数据表中得数据
            $id=\Yii::$app->user->id;
            //var_dump($id);exit;
            $cartss=Acrt::find()->where(['member_id'=>$id])->all();
            $carts=[];
             foreach ($cartss as $cart){
                 //var_dump($cart);exit;
                 $carts[$cart->goods_id]=$cart->amount;
            }
            //var_dump($carts);exit;
            $models=Goods::find()->where(['in','id',array_keys($carts)])->all();
---
SELECT * FROM `goods` WHERE `id` IN (33, 37)