frontend/controllers/OrderController.php

    public function actionOrder(){
        if (\Yii::$app->user->isGuest){
            \Yii::$app->session->setFlash('success','请登录');
            return $this->redirect(['member/login']);
        }
            $model=new Order();
        //根据用户ID查询cart表中用户的所有goods_id数据----为数组
        $goods_ids=Acrt::find()->select('goods_id')->where(['member_id'=>\Yii::$app->user->id])->asArray()->column();
        //查询商品数量
        $cartss=Acrt::find()->where(['member_id'=>\Yii::$app->user->id])->all();
        //var_dump($cartss);exit;
        $sum=[];
        foreach ($cartss as $cart){
            //var_dump($cart);exit;
            $sum[$cart->goods_id]=$cart->amount;
        }
        //var_dump($sum);exit;
        $num = Acrt::find()->where(['member_id'=>\Yii::$app->user->id])->sum('amount');//商品总数
        //var_dump($num);exit;
        //查询数组中商品ID的商品数据
        $goods=Goods::find()->where(['in','id',$goods_ids])->all();
        //var_dump($goods);exit;
        // var_dump($goods);exit;
        $address = Address::find()->where(['member_id'=>\Yii::$app->user->id])->all();//地址数据
---
SELECT * FROM `goods` WHERE `id` IN ('33', '37')
SELECT * FROM `address` WHERE `member_id` IS NULL

                //var_dump($address_id);exit;
                $model->create_time=time();//创建时间
                //----收货人信息------
                $address=Address::findOne(['id'=>$address_id]);
---
SELECT * FROM `address` WHERE `id` IS NULL

                Acrt::deleteAll(['member_id'=>\Yii::$app->user->id]);
                //order表的总金额 加上邮寄的金额
                $model->total=$total+Order::$deliveries[$delivery_id]['price'];
                $model->update(false,['total']);
---
UPDATE `order` SET `total`='10' WHERE `id`=11