backend/models/Admin.php

SELECT * FROM `menu` WHERE `parent_id`=0
SELECT * FROM `menu` WHERE `parent_id`=3
---
    public static function getMenus()
    {
//        return [
//            ['label'=>'用户管理','items'=>[
//                ['label'=>'添加用户','url'=>['admin/add']],
//                ['label'=>'添加用户','url'=>['admin/add']],
//            ]],
//        ];
        //定义一个数组来存放遍历出来的二级菜单
        $menuItems = [];
        $menus = Menu::find()->where(['parent_id' => 0])->all();
        //var_dump($menus);exit;
        //遍历出所有的以及菜单
        foreach ($menus as $menu) {
            //查找二级分类
            $children = Menu::find()->where(['parent_id' => $menu->id])->all();

SELECT * FROM `admin` WHERE `id`=16
---
    public static function findIdentity($id)
    {
        return self::findOne(['id'=>$id]);