backend/models/GoodsCategory.php

SELECT `id`, `parent_id`, `name` FROM `goods_category`
---
    public static function getZNodes(){
        $top=['id'=>0,'name'=>'顶级分类','parent_id'=>0];
        $goodscategorys =GoodsCategory::find()->select(['id','parent_id','name'])->asArray()->all();